-- 1. 부서번호(department_id)별로 그룹화하여 부서번호(department_id)와 부서별 사원수를 조회하시오.


-- 2. 부서번호(department_id)별로 집계하여 부서번호(department_id)와 부서별 급여(salary)평균을 조회하시오.
--    급여(salary)평균은 소수 1자리로 반올림하고, 부서번호(department_id)순으로 오름차순 정렬해서 조회하시오.


-- 3. 동일한 직업아이디(job_id)을 가진 사원들의 직업아이디(job_id)와 인원수와 최대급여 및 최소급여를 조회하시오.
--    급여평균의 오름차순 정렬로 조회하시오.


-- 4. 소속된 사원수가 5명 이상인 부서번호(department_id)와 해당 부서의 사원수를 조회하시오.
--   부서번호(department_id)의 내림차순으로 정렬하여 조회하시오.


-- 5. 급여(salary)평균이 10000 이상인 부서의 부서번호(department_id)와 급여(salary)평균을 조회하시오.
--    급여(salary)는 정수로 절사처리하시오.


-- 6. 부서번호(department_id)마다 같은 직업아이디(job_id)를 가진 사원수를 조회하시오.
--    조회된 사원수를 기준으로 내림차순 정렬하여 조회하시오.
--    단, 부서번호(department_id)가 없는 사원은 조회하지 않는다.
